tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI
brew "fish"
brew "fisher"
brew "bat"
brew "fd"
brew "fzf"

brew "vim"
brew "git"
brew "git-lfs"
brew "starship"
brew "stow"
cask "ngrok"


# Image Tools
brew "imagemagick"
brew "vips"

# Essentials
cask "1Password"
cask "notion"
cask "spotify"
cask "setapp"
cask "firefox"
cask "arc"
cask "raycast"
cask "secretive"
cask "mimestream"
cask "hyperkey"
brew "iconsur"

# Dev environment
cask "visual-studio-code"
cask "iterm2"
cask "kaleidoscope"
cask "fantastical"
brew "asdf"
brew "redis", restart_service: :changed
brew "rabbitmq", restart_service: :changed
brew "hivemind"
brew "phrase"
brew "yarn"
brew "pkg-config"
brew "pcre"
brew "python"

# GCP
cask "google-cloud-sdk"
brew "stern"
brew "kubectx"

# Fonts
cask "font-sf-mono"
cask "font-ibm-plex-mono"
